olympiabd/HotelAvailRQ.xml

<?xml version="1.0" encoding="utf-8"?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
	<soap-env:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsse:Username>628347</wsse:Username>
			<wsse:Password>clubtest</wsse:Password>
			<Context>olympia_europe_ts</Context>
		</wsse:Security>
	</soap-env:Header>
	<soap-env:Body>
		<OTA_HotelAvailRQ xmlns="http://parsec.es/hotelapi/OTA2014Compact" >
			<HotelSearch>
				<Currency Code="USD"/>
				<HotelLocation CityCode="7"/>
				<DateRange Start="2020-12-05" End="2020-12-09"/>
				<RoomCandidates>  
					<RoomCandidate RPH="1">
						<Guests>
                            <Guest AgeCode="A" Count="2" />
						</Guests>
                    </RoomCandidate>
                    <RoomCandidate RPH="2">
						<Guests>
                            <Guest AgeCode="A" Count="3" />
						</Guests>
                    </RoomCandidate>
                    <RoomCandidate RPH="3">
						<Guests>
                            <Guest AgeCode="A" Count="3" />
						</Guests>
                    </RoomCandidate>
				</RoomCandidates>
			</HotelSearch>
		</OTA_HotelAvailRQ>
	</soap-env:Body>
</soap-env:Envelope>